PANDAS 53

#53: Membuat kategori baru menurut threshold

In [1]:
import pandas as pd
import numpy as np
print(pd.__version__)
print(np.__version__)

2.3.3
2.3.5

In [2]:
d = {'hobi':['jogging', 'mancing', 'renang',
             'mancing', 'mancing', 'baca', 
             'baca', 'mancing', 'fotograsi', 
             'mancing', 'camping']}
df = pd.DataFrame(d)
df

         hobi
0     jogging
1     mancing
2      renang
3     mancing
4     mancing
5        baca
6        baca
7     mancing
8   fotograsi
9     mancing
10    camping

Membuat kategori baru berdasarkan threshold (ambang batas)

In [3]:
df['hobi'].value_counts()

hobi
mancing      5
baca         2
jogging      1
renang       1
fotograsi    1
camping      1
Name: count, dtype: int64

In [4]:
persentase = df['hobi'].value_counts(normalize=True)
persentase

hobi
mancing      0.454545
baca         0.181818
jogging      0.090909
renang       0.090909
fotograsi    0.090909
camping      0.090909
Name: proportion, dtype: float64

In [5]:
threshold = 0.1
hobi_lain = persentase[persentase < threshold].index
hobi_lain

Index(['jogging', 'renang', 'fotograsi', 'camping'], dtype='object', name='hobi')

In [6]:
df['hobi'] = df['hobi'].replace(hobi_lain, 'lainnya')
df['hobi']

0     lainnya
1     mancing
2     lainnya
3     mancing
4     mancing
5        baca
6        baca
7     mancing
8     lainnya
9     mancing
10    lainnya
Name: hobi, dtype: object

In [7]:
df['hobi'].value_counts(normalize=True)

hobi
mancing    0.454545
lainnya    0.363636
baca       0.181818
Name: proportion, dtype: float64

PANDAS 54

#54: Menyimpan Data Frame sebagai file CSV

In [26]:
data = {'nama':['bejo', 'tejo', 'wati', 'tiwi', 'cecep'],'jenis_kelamin':['L', 'L', 'P', 'P', 'L'],'umur':[20, 21, 19, 20, 22]}
df = pd.DataFrame(data)
df

    nama jenis_kelamin  umur
0   bejo             L    20
1   tejo             L    21
2   wati             P    19
3   tiwi             P    20
4  cecep             L    22

In [14]:
df.to_csv('data_peserta.csv')

In [15]:
df = pd.read_csv('data_peserta.csv')

In [16]:
df.to_csv('data_peserta_tanpa_index.csv', index=False)
df = pd.read_csv('data_peserta_tanpa_index.csv')
df

   Unnamed: 0   nama jenis_kelamin  umur
0           0   bejo             L    20
1           1   tejo             L    21
2           2   wati             P    19
3           3   tiwi             P    20
4           4  cecep             L    22

PANDAS 55

#55: Menghitung jumlah baris menurut kriteria tertentu

In [19]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(
    np.random.randint(1, 10, size=(n_rows, n_cols)),
    columns=cols
)
df

   A  B  C  D  E
0  4  5  7  3  5
1  8  5  1  1  2
2  4  8  4  9  4
3  1  5  3  4  7
4  4  5  5  6  4
5  3  4  4  6  5
6  2  1  6  4  3
7  3  5  2  8  7
8  2  2  7  6  4
9  2  6  6  2  9

In [20]:
(df['A']< 5).sum()

np.int64(9)

In [21]:
(df['A']< 5).mean()

np.float64(0.9)

PANDAS 56

#56: Mengeluarkan kolom dari Data Frame dengan pop()

In [25]:
data = {'nama':['bejo', 'tejo', 'wati', 'tiwi', 'cecep'],'jenis_kelamin':['L', 'L', 'P', 'P', 'L'],'umur':[20, 21, 19, 20, 22]}
df = pd.DataFrame(data)
df

    nama jenis_kelamin  umur
0   bejo             L    20
1   tejo             L    21
2   wati             P    19
3   tiwi             P    20
4  cecep             L    22

In [ ]:
usia = df.pop('umur').to_frame()

In [31]:
print(df)

    nama jenis_kelamin
0   bejo             L
1   tejo             L
2   wati             P
3   tiwi             P
4  cecep             L

In [32]:
print(usia)

   umur
0    20
1    21
2    19
3    20
4    22